//==============================================================
//
//プレイヤー処理[player.cpp]
//Author:佐久間優香
//
//==============================================================
#include"character.h"
#include"renderer.h"
#include"manager.h"
#include"input.h"
#include"model.h"
#include"motion.h"
#include"objectX.h"
#include <stdio.h>
#include"debugproc.h"
#include"game.h"

//==============================================================
//コンストラクタ
//==============================================================
CCharacter::CCharacter()
{

}

//==============================================================
//デストラクタ
//==============================================================
CCharacter::~CCharacter()
{

}

//==============================================================
//プレイヤーモデルの生成処理
//==============================================================
CCharacter *CCharacter::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	CCharacter *pPlayerModel = NULL;

	if (pPlayerModel == NULL)
	{//メモリが使用されてなかったら

	 //プレイヤーの生成
		pPlayerModel = new CCharacter;
	}

	
	return pPlayerModel;
}

//==============================================================
//プレイヤーモデルの初期化処理
//==============================================================
HRESULT CCharacter::Init(void)
{
	

	return S_OK;
}

//==============================================================
//プレイヤーモデルの終了処理
//==============================================================
void CCharacter::Uninit(void)
{

}

//==============================================================
//プレイヤーモデルの更新処理
//==============================================================
void CCharacter::Update(void)
{
	CDebugProc *pDebugProc = CManager::Get()->GetDebugProc();

	
}

//==============================================================
////プレイヤーモデルの描画処理
//==============================================================
void CCharacter::Draw(void)
{

}
