//==============================================================
//
//弾処理[player.cpp]
//Author:佐久間優香
//
//==============================================================
#include"coa.h"
#include"manager.h"
#include"explosion.h"
#include"billboard.h"
#include"texture.h"
#include"object.h"
#include"objectX.h"
#include"model.h"
#include"motion.h"
#include"player.h"
#include"game.h"
#include"bullet.h"


//マクロ定義
#define LIFE				(50)			//寿命
//==============================================================
//コンストラクタ
//==============================================================
CCOa::CCOa()
{
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);		//移動量
	m_move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);		//移動量
	m_posOld = D3DXVECTOR3(0.0f, 0.0f, 0.0f);	//前回の位置
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);		//向き
	m_nLife = LIFE;								//寿命
}

//==============================================================
//デストラクタ
//==============================================================
CCOa::~CCOa()
{

}

//==============================================================
//弾の生成処理
//==============================================================
CCOa *CCOa::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	CCOa *pCoa = nullptr;

	if (pCoa == nullptr)
	{

		pCoa = new CCOa;

		//初期化処理
		pCoa->Init();

		pCoa->SetPosition(pos);

		pCoa->SetRotation(rot);
	}

	return pCoa;
}

//==============================================================
//弾の初期化処理
//==============================================================
HRESULT CCOa::Init(void)
{
	//m_pModel = CModel::Create(m_pos,m_rot, "data\\MODEL\\Ground00.x" );

	////オブジェクト2Dの初期化処理
	//CObject::Init();

	////種類の設定
	//CObject::SetType(CObject::TYPE_BULLET);

	return S_OK;
}

//==============================================================
//弾の終了処理
//==============================================================
void CCOa::Uninit(void)
{

}

//==============================================================
//弾の更新処理
//==============================================================
void CCOa::Update(void)
{	
		SetState();
}

//==============================================================
//弾の描画処理
//==============================================================
void CCOa::Draw(void)
{

}

//==============================================================
//状態設定
//==============================================================
void CCOa::SetState(void)
{

}